In [3]:
import pandas as pd

In [5]:
data = {
    "date": ["2021-12-01", "01-12-2022", "2022/12/01", "12-01-2021"],
    "country": ["USA", "U.S.A.", "America", "United States"],
    "name": ["John Doe", "Jonh Doe", "Jane Doe", "Jane Doe"],
    "sales_2020": [100, 200, None, 200],
    "sales_2021": [None, 150, 300, 150],
}

df = pd.DataFrame(data)

In [6]:
df.head()

         date        country      name  sales_2020  sales_2021
0  2021-12-01            USA  John Doe       100.0         NaN
1  01-12-2022         U.S.A.  Jonh Doe       200.0       150.0
2  2022/12/01        America  Jane Doe         NaN       300.0
3  12-01-2021  United States  Jane Doe       200.0       150.0

In [ ]:
# normalizing the date
df['date'] = pd.to_datetime(df['date'], errors='coerce', dayfirst=True)

In [9]:
df

        date        country      name  sales_2020  sales_2021
0 2021-01-12            USA  John Doe       100.0         NaN
1        NaT         U.S.A.  Jonh Doe       200.0       150.0
2        NaT        America  Jane Doe         NaN       300.0
3        NaT  United States  Jane Doe       200.0       150.0

In [12]:
df['date'] = df['date'].fillna(df['date'][0])

In [13]:
df

        date        country      name  sales_2020  sales_2021
0 2021-01-12            USA  John Doe       100.0         NaN
1 2021-01-12         U.S.A.  Jonh Doe       200.0       150.0
2 2021-01-12        America  Jane Doe         NaN       300.0
3 2021-01-12  United States  Jane Doe       200.0       150.0

In [17]:
# Normalize country name
country_map = {
    'USA': 'USA',
    'U.S.A.':'USA',
    'America': 'USA',
    'United States': 'USA'
}

df['country'] = df['country'].replace(country_map)

In [18]:
df['country']

0    USA
1    USA
2    USA
3    USA
Name: country, dtype: object

In [19]:
# Name Errors
df['name'] = df['name'].replace({"Jonh Doe": "John Doe"})

In [20]:
df

        date country      name  sales_2020  sales_2021
0 2021-01-12     USA  John Doe       100.0         NaN
1 2021-01-12     USA  John Doe       200.0       150.0
2 2021-01-12     USA  Jane Doe         NaN       300.0
3 2021-01-12     USA  Jane Doe       200.0       150.0

In [23]:
# fill gaps
from sklearn.impute import SimpleImputer

imputer = SimpleImputer(strategy="median")
df["sales_2020"] = imputer.fit_transform(df[["sales_2020"]])
df["sales_2021"] = imputer.fit_transform(df[["sales_2021"]])

In [25]:
df

        date country      name  sales_2020  sales_2021
0 2021-01-12     USA  John Doe       100.0       150.0
1 2021-01-12     USA  John Doe       200.0       150.0
2 2021-01-12     USA  Jane Doe       200.0       300.0
3 2021-01-12     USA  Jane Doe       200.0       150.0